
class Messages:

    START_MSG = "مرحبا {}.\n\nانا بوت الرفع الى اليوتيوب.تستطيع استخدامي لرفع الفديوهات من التلقرام الى اليوتيوب .لربط قناتك اليوتيوب مع البوت اضغط  /help.\n\nوشكرا لك ."

    HELP_MSG = [
        ".",
        "مرحبا بك .\n\nاولا . يجب أن تدرك أن موقع يوتيوب يتعرف على كل فيديو تم تحميله ، وأن الذكاء الاصطناعي الخاص به مدهش يستطيع يميز الفيديو المحتوي   على حقوق الطبع والنشر إذا وجد محتوى بها حقوق لقناة اخرى بمجرد تحميله ، سيقوم بحذف  الفيديو.\n\nRead through all the pages to know how I work.",

        "**خطوات تفعيل البوت .**\n\n**الخطوة الاولى :** __انت يجب ان تربط قناتك اليوتيوب مع البوت ستعرف ذلك بالخطوات التالية .__\n\n**الخطوة الثانية :** __قم بارسال الفديو المراد تحميله لليوتيوب .__\n\n**الخطوة الثالثة:** رد على الفديو الي رسلته بالامر /upload مع عنوان الفديو.\n\n**الخطوة الرابعة :** انا ساقوم برفع الفديو لقناتك على يوتيوب  .__\n\n**الخطوة الخامسة :** انا ساقوم بارسال رابط الفديو اليك ",

        "**اصنع قناتك اليوتيوب **\n\nاذا لم يكن لديك قناة يوتيوب لن تستطيع الاستفاده من البوت .لذلك اذا لا يوجد لديك قناة اصنع لك واحده .\n\n**الخطوة الاولى :**  قم بتسجيل الخول الى يوتيوب عبر بريدك .__\n\n**الخطوة الثانية :** قم بنشر بعض الفديوهات وسوي تعليقات بمعنى ان تتفاعل قليلا \n\n**الخطوة الثالثة :** بعد ان تصنع قناة وتكون جاهزة  اضغط التالي",

        "**تاكيد قناتك عبر رقم الهاتف**\n\nيجب عليك تاكيد قناتك من اجل تجنب حظر القناة من يوتيوب . بعد ان تسوي تاكيد للقناة تستطيع ان تقوم برفع الفديوهات .  اذا لم تقوم بتاكيد قناتك برقم الاتف لن تستطيع رفع لفديوهات اكثر من 15 دقيقه .\n[لتاكيد قناتك اضغط هنا .](http://www.youtube.com/verify)\n\n بعد ذلك يمكنك استخدام البوت بنجاح ",

        "**الان دعنا نربط قناتك بالبوت .**\n\n اضغط على اربط قناتي بالزر بالاسفل واعطيني صلاحيات النشر للفديوهات وسوف يعطيك كود قم بنسخه  قم بارسال الكود وقبله الامر التالي /authorise الكود هنا  .\n\n**ملاحظة !**\nنحن لسنا مخترقين ابدا ونحترم خصوصيات الناس. . نحن  نحن هنا لمساعدتكم ."
    ]

    NOT_A_REPLY_MSG = "Please reply to some video file."

    NOT_A_MEDIA_MSG = "لا يوجد ملف وسائط . "+NOT_A_REPLY_MSG

    NOT_A_VALID_MEDIA_MSG = "المعذرة لا يمكنني تحميل هذا النوع من الوسائط "
    
    DAILY_QOUTA_REACHED = "يبدو أنك تحاول تحميل أكثر من 6 مقاطع فيديو اليوم! بشكل افتراضي ، يسمح موقع youtube بحوالي 6 تحميلات يوميًا فقط ، لذلك قد يفشل هذا الطلب !!"

    PROCESSING = "جاري رفع الفديو ....."

    NOT_AUTHENTICATED_MSG = "لم تقوم بربط قناتك  بالبوت بالوقت الحالي اضغط  /help  للمساعدة"

    NO_AUTH_CODE_MSG = "لا يوجد اي كود يجب ان تزودني بكود "

    AUTH_SUCCESS_MSG = "مبرووك لقد قمت بربط البوت بنجاح .\nاستمتع بتحميل الفديوهات !"

    AUTH_FAILED_MSG = "فشلت عملية ربط القناة \nالتفاصيل :{}"
    
    AUTH_DATA_SAVE_SUCCESS = "تم حفظ البيانات بنجاح!"
    
